In [2]:
import numpy as np
import pandas as pd

# Uvoz in priprava podatkov

## PRIMER 1

### 1. Read csv file into a pandas dataframe

In [3]:
# rešitev
data=pd.read_csv('data/DATA_DN_property data.csv')

### 2. Take a look at the first 5 rows

In [4]:
# rešitev
data.head(5)

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3       1.0  1000
1  100002000.0   197.0  LEXINGTON            N            3       1.5    --
2  100003000.0     NaN  LEXINGTON            N          NaN       1.0   850
3  100004000.0   201.0   BERKELEY           12            1       NaN   700
4          NaN   203.0   BERKELEY            Y            3       2.0  1600

### 3. Select and print the ST_NUM column

In [5]:
# rešitev
data['ST_NUM']

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

### 4. Standard Missing Values: Check the misssing values in ST_NUM column with isnull() method

In [7]:
# rešitev
data['ST_NUM'].isnull().any()

True

### 5. Non-Standard Missing Values: Pandas didn't recognized the "--" and "na" as a missing value. in the NUM_BEDROOMS column. Try to detect these various missing values with the na_values parameter when importing the data with read_csv.

In [7]:
#rešitev

In [12]:
data[data['NUM_BEDROOMS'].str.isnumeric()==False]

           PID  ST_NUM  ST_NAME OWN_OCCUPIED NUM_BEDROOMS  NUM_BATH SQ_FT
7  100008000.0   213.0  TREMONT            Y           --       1.0   NaN
8  100009000.0   215.0  TREMONT            Y           na       2.0  1800

### 6. Unexpected Missing Values

For example, if our feature is expected to be a string, but there’s a numeric type, then technically this is also a missing value.

#### Display the OWN_OCCUPIED column and it's missing values with isnull()

In [15]:
# rešitev
data[data['OWN_OCCUPIED'].isnull()==True]

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS  NUM_BATH SQ_FT
6  100007000.0     NaN  WASHINGTON          NaN            2       2.0   950

In [16]:
# rešitev
data[data['OWN_OCCUPIED'].str.isnumeric()==True]

           PID  ST_NUM   ST_NAME OWN_OCCUPIED NUM_BEDROOMS  NUM_BATH SQ_FT
3  100004000.0   201.0  BERKELEY           12            1       NaN   700

In the fourth row, there’s the number 12. The response for Owner Occupied should clearly be a string (Y or N), so this numeric type should be a missing value.

#### Write a loop to detect int values in the OWN_OCCUPIED column and count them

In [18]:
# rešitev
data['OWN_OCCUPIED'].str.isnumeric().sum()

1

### 7. Print the total number of missing values for each column.

In [27]:
# rešitev
len(data)-data.count()

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    1
NUM_BEDROOMS    2
NUM_BATH        1
SQ_FT           1
dtype: int64

### 8. Check to see if we have any missing values in the df at all in one line.

Hint: `.any()` method

In [31]:
#rešitev
data.isnull().any(axis=0)

PID              True
ST_NUM           True
ST_NAME         False
OWN_OCCUPIED     True
NUM_BEDROOMS     True
NUM_BATH         True
SQ_FT            True
dtype: bool

### 9. Total count of missing values.

In [37]:
#rešitev
data.isnull().sum().sum()

8

### 10. Replace missing values with a number 125 in the ST_NUM column

In [44]:
# rešitev
data['ST_NUM']=data['ST_NUM'].fillna(125)
data['ST_NUM']

0    104.0
1    197.0
2    125.0
3    201.0
4    203.0
5    207.0
6    125.0
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

###  11. Replace missing values with a median value in the NUM_BEDROOMS column

In [16]:
# rešitev
################
###############
###############
#################
################ ZA POPRAVIT

In [53]:
data['NUM_BEDROOMS']=data['NUM_BEDROOMS'].fillna(data.loc[data['NUM_BEDROOMS'].str.isnumeric()==True,'NUM_BEDROOMS'].median())
data['NUM_BEDROOMS']

0     3
1     3
2     3
3     1
4     3
5     3
6     2
7    --
8    na
Name: NUM_BEDROOMS, dtype: object